In [1]:
import pandas as pd
import numpy as np
df = pd.read_csv("products.csv")

In [2]:
df.shape

(500000, 3)

In [3]:
df.head()

,name,sku,description
0,Bryce Jones,lay-raise-best-end,Art community floor adult your single type. Pe...
1,John Robinson,cup-return-guess,Produce successful hot tree past action young ...
2,Theresa Taylor,step-onto,Choice should lead budget task. Author best me...
3,Roger Huerta,citizen-some-middle,Important fight wrong position fine. Friend so...
4,John Buckley,term-important,Alone maybe education risk despite way.\nWant ...

In [4]:
df["description"][1]

'Produce successful hot tree past action young song. Himself then tax eye little last state vote. Country down list that speech economy leave.'

In [5]:
df.isnull().sum()

name           0
sku            0
description    0
dtype: int64

In [7]:
df[df["name"]=="Aaron Anderson"].count()

name           14
sku            14
description    14
dtype: int64

In [1]:
import pandas as pd
import sqlite3

#read the CSV
df = pd.read_csv('products.csv')
#connect to a database
conn = sqlite3.connect("Product_Database.db") #if the db does not exist, this creates a Any_Database_Name.db file in the current directory
#store your table in the database:
df.to_sql('Product_Table', conn)
#read a SQL Query out of your database and into a pandas dataframe

In [4]:
sql_string = 'SELECT name,count(*) FROM Product_Table GROUP BY name HAVING COUNT(*)>8 LIMIT 10'
df = pd.read_sql(sql_string, conn)

In [5]:
df

              name  count(*)
0   Aaron Anderson        14
1      Aaron Brown        21
2   Aaron Campbell         9
3    Aaron Coleman         9
4      Aaron Davis        17
5     Aaron Garcia        11
6     Aaron Harris         9
7  Aaron Hernandez        14
8    Aaron Jackson         9
9      Aaron Jones        24